app/Models/ModelAuth.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '8cb2237d0679ca88db6464eac60da96345513964'
---
    public function Login($email, $password)
    {
        return $this->db->table('tbl_user')
        ->where ('email', $email)
        ->where ('password', $password)
        ->get()->getRowArray();