app/Models/ModelSekolah.php

    public function AllData()
    {
        return $this->db->table('tbl_sekolah')
        ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang', 'left')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`