app/Models/ModelJenjang.php

SELECT *
FROM `tbl_jenjang`
---
    public function AllData()
    {
        return $this->db->table('tbl_jenjang')
        ->get()->getResultArray();