app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
---
    public function AllData()
    {
        return $this->db->table('tbl_user')
        ->get()->getResultArray();

SELECT *
FROM `tbl_user`
WHERE `id_user` = '1'
---
    public function DetailData($id_user)
    {
        return $this->db->table('tbl_user')
        ->where('id_user', $id_user)
        ->get()->getRowArray();

UPDATE `tbl_user` SET `id_user` = '1', `nama_user` = 'Rayaka', `email` = 'admin@gmail.com', `password` = '8cb2237d0679ca88db6464eac60da96345513964', `foto` = '1745340245_1e5f2e82829817552276.jpeg'
WHERE `id_user` = '1'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_user')
        ->where('id_user', $data['id_user'])
        ->update($data);