app/Models/ModelAdmin.php

    public function JmlWilayah()
    {
        return $this->db->table('tbl_wilayah')
        ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_wilayah`

    public function JmlSekolah()
    {
        return $this->db->table('tbl_sekolah')
        ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_sekolah`