app/Views/v_dashboard.php

<?php
$db = \Config\Database::connect();
foreach ($jenjang as $key => $value) {
    $jml = $db->table('tbl_sekolah')->where('id_jenjang', $value['id_jenjang'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_sekolah`
WHERE `id_jenjang` = '1'